In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [13]:
#step 5
names.groupby(['year', 'sex']).sum()
names.head()

C:\Users\layla\AppData\Local\Temp\ipykernel_12384\1019536953.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  names.groupby(['year', 'sex']).sum()

        name sex  birth  year
0       Mary   F   7065  1880
1       Anna   F   2604  1880
2       Emma   F   2003  1880
3  Elizabeth   F   1939  1880
4     Minnie   F   1746  1880